<template>
  <section class="container mt-3 pb-5">
    <h3 class="text-center">Мои контакты</h3>
    <article class="text-center mb-5">
      Актуальные способы связаться со мной по любому вопросу :)
    </article>
    <div class="row">

      <div class="col-12 col-md-7">
        <h4>Приоритетные способы связи</h4>

        <div class="row">
          <div class="col-12 col-lg-6">
            <ovc-contact-card class="mt-3">
              <template #icon>
                <svg fill="none" viewBox="0 0 52 52" width="100%" xmlns="http://www.w3.org/2000/svg">
                  <rect height="50" rx="13" stroke="var(--accent)" stroke-width="2" width="50" x="1" y="1"/>
                  <path clip-rule="evenodd"
                        d="M11.1311 24.7623C19.4526 21.2343 25.0015 18.9083 27.778 17.7846C35.7052 14.576 37.3525 14.0186 38.4261 14.0002C38.6622 13.9961 39.1902 14.0531 39.5322 14.3232C39.821 14.5512 39.9005 14.8592 39.9385 15.0754C39.9765 15.2916 40.0239 15.7841 39.9862 16.1689C39.5566 20.5613 37.6978 31.2203 36.7522 36.1397C36.3521 38.2214 35.5642 38.9193 34.8014 38.9876C33.1437 39.1361 31.885 37.9216 30.2794 36.8974C27.7671 35.2948 26.3478 34.2972 23.9091 32.7333C21.0908 30.926 22.9178 29.9327 24.5239 28.3094C24.9443 27.8845 32.248 21.4198 32.3894 20.8334C32.407 20.76 32.4235 20.4866 32.2566 20.3422C32.0896 20.1979 31.8433 20.2472 31.6655 20.2865C31.4136 20.3422 27.4001 22.9236 19.625 28.0309C18.4858 28.7921 17.454 29.1631 16.5294 29.1436C15.5102 29.1222 13.5497 28.5828 12.0922 28.1218C10.3046 27.5563 8.88379 27.2574 9.00751 26.297C9.07195 25.7968 9.77981 25.2853 11.1311 24.7623Z"
                        fill="var(--accent)"
                        fill-rule="evenodd"/>
                </svg>
              </template>
              @siailya
              <template #caption>
                <ovc-link to="https://t.me/siailya" external>t.me/siailya</ovc-link>
              </template>
            </ovc-contact-card>
          </div>
          <div class="col-12 col-lg-6">
            <ovc-contact-card class="mt-3">
              <template #icon>
                <svg fill="none" viewBox="0 0 52 52" width="100%" xmlns="http://www.w3.org/2000/svg">
                  <rect height="50" rx="13" stroke="var(--accent)" stroke-width="2" width="50" x="1" y="1"/>
                  <path
                      d="M27.9193 36.42C16.3157 36.42 9.27584 28.3779 9 15H14.8769C15.0601 24.827 19.5311 28.9809 22.9585 29.8371V15H28.5905V23.4857C31.8963 23.1193 35.3564 19.257 36.5195 15H42.0629C41.1758 20.2347 37.4089 24.0802 34.7472 25.6714C37.411 26.9579 41.6965 30.3291 43.3494 36.42H37.2564C35.9699 32.3484 32.8184 29.211 28.5925 28.7829V36.42H27.9193Z"
                      fill="var(--accent)"/>
                </svg>
              </template>
              Илья Самойлов
              <template #caption>
                <ovc-link to="https://vk.com/siailya" external>vk.com/siailya</ovc-link>
              </template>
            </ovc-contact-card>
          </div>
        </div>

        <hr>

        <h4>Ещё можно</h4>

        <div class="row">
          <div class="col-12 col-lg-6">
            <ovc-contact-card class="mt-3">
              <template #icon>
                <svg fill="none" viewBox="0 0 52 52" width="100%" xmlns="http://www.w3.org/2000/svg">
                  <path
                      d="M17.4648 24.0703C19.8398 28.6719 23.3281 32.1602 27.9297 34.5352L31.418 31.0469C31.9128 30.5521 32.457 30.4284 33.0508 30.6758C34.832 31.2695 36.7122 31.5664 38.6914 31.5664C39.1367 31.5664 39.5078 31.7148 39.8047 32.0117C40.1016 32.3086 40.25 32.6797 40.25 33.125V38.6914C40.25 39.1367 40.1016 39.5078 39.8047 39.8047C39.5078 40.1016 39.1367 40.25 38.6914 40.25C31.2695 40.25 24.9115 37.6276 19.6172 32.3828C14.3724 27.0885 11.75 20.7305 11.75 13.3086C11.75 12.8633 11.8984 12.4922 12.1953 12.1953C12.4922 11.8984 12.8633 11.75 13.3086 11.75H18.875C19.3203 11.75 19.6914 11.8984 19.9883 12.1953C20.2852 12.4922 20.4336 12.8633 20.4336 13.3086C20.4336 15.2878 20.7305 17.168 21.3242 18.9492C21.5221 19.5924 21.3984 20.1367 20.9531 20.582L17.4648 24.0703Z"
                      fill="var(--accent)"/>
                  <rect height="50" rx="13" stroke="var(--accent)" stroke-width="2" width="50" x="1" y="1"/>
                </svg>
              </template>
              Позвонить
              <template #caption>
                <ovc-link to="tel:+7-999-516-63-83" external>+7-999-516-63-83</ovc-link>
              </template>
            </ovc-contact-card>
          </div>
          <div class="col-12 col-lg-6">
            <ovc-contact-card class="mt-3">
              <template #icon>
                <svg fill="none" viewBox="0 0 52 52" width="100%" xmlns="http://www.w3.org/2000/svg">
                  <path
                      d="M38.6914 19.6914V16.5L26 24.4414L13.3086 16.5V19.6914L26 27.5586L38.6914 19.6914ZM38.6914 13.3086C39.5326 13.3086 40.25 13.6302 40.8438 14.2734C41.487 14.9167 41.8086 15.6589 41.8086 16.5V35.5C41.8086 36.3411 41.487 37.0833 40.8438 37.7266C40.25 38.3698 39.5326 38.6914 38.6914 38.6914H13.3086C12.4674 38.6914 11.7253 38.3698 11.082 37.7266C10.4883 37.0833 10.1914 36.3411 10.1914 35.5V16.5C10.1914 15.6589 10.4883 14.9167 11.082 14.2734C11.7253 13.6302 12.4674 13.3086 13.3086 13.3086H38.6914Z"
                      fill="var(--accent)"/>
                  <rect height="50" rx="13" stroke="var(--accent)" stroke-width="2" width="50" x="1" y="1"/>
                </svg>
              </template>
              Написать
              <template #caption>
                <ovc-link to="mailto:sia.ilya.dev@gmail.com" target="_blank" external>sia.ilya.dev@gmail.com</ovc-link>
              </template>
            </ovc-contact-card>
          </div>
        </div>
      </div>
      <div class="col-12 col-md-5 border-start border-1 border-hr mt-3 mt-md-0">
        <h4>Ещё я обитаю тут</h4>

        <div class="row">
          <div class="col-12 col-lg-7">
            <ovc-contact-card class="mt-3">
              <template #icon>
                <svg width="100%" viewBox="0 0 52 52" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect x="1" y="1" width="50" height="50" rx="13" stroke="var(--accent)" stroke-width="2"/>
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M11.1311 24.7623C19.4526 21.2343 25.0015 18.9083 27.778 17.7846C35.7052 14.576 37.3525 14.0186 38.4261 14.0002C38.6622 13.9961 39.1902 14.0531 39.5322 14.3232C39.821 14.5512 39.9005 14.8592 39.9385 15.0754C39.9765 15.2916 40.0239 15.7841 39.9862 16.1689C39.5566 20.5613 37.6978 31.2203 36.7522 36.1397C36.3521 38.2214 35.5642 38.9193 34.8014 38.9876C33.1437 39.1361 31.885 37.9216 30.2794 36.8974C27.7671 35.2948 26.3478 34.2972 23.9091 32.7333C21.0908 30.926 22.9178 29.9327 24.5239 28.3094C24.9443 27.8845 32.248 21.4198 32.3894 20.8334C32.407 20.76 32.4235 20.4866 32.2566 20.3422C32.0896 20.1979 31.8433 20.2472 31.6655 20.2865C31.4136 20.3422 27.4001 22.9236 19.625 28.0309C18.4858 28.7921 17.454 29.1631 16.5294 29.1436C15.5102 29.1222 13.5497 28.5828 12.0922 28.1218C10.3046 27.5563 8.88379 27.2574 9.00751 26.297C9.07195 25.7968 9.77981 25.2853 11.1311 24.7623Z" fill="var(--accent)"/>
                </svg>
              </template>

              Мой канал

              <template #caption>
                <ovc-link to="https://t.me/samolyev" target="_blank" external>t.me/samolyev</ovc-link>
              </template>
            </ovc-contact-card>
          </div>
        </div>

        <div class="row">
          <div class="col-12 col-lg-7">
            <ovc-contact-card class="mt-3">
              <template #icon>
                <svg fill="none" viewBox="0 0 52 52" width="100%" xmlns="http://www.w3.org/2000/svg">
                  <rect height="50" rx="13" stroke="var(--accent)" stroke-width="2" width="50" x="1" y="1"/>
                  <path clip-rule="evenodd" d="M26.4984 9C16.836 9 9 16.8038 9 26.4308C9 34.1307 14.0138 40.6643 20.9678 42.9702C21.8434 43.1296 22.1625 42.5914 22.1625 42.1292C22.1625 41.7151 22.1474 40.6193 22.1388 39.1652C17.2711 40.2181 16.2441 36.8282 16.2441 36.8282C15.448 34.8144 14.3007 34.2784 14.3007 34.2784C12.7118 33.1976 14.421 33.219 14.421 33.219C16.1775 33.3421 17.1014 35.0156 17.1014 35.0156C18.6624 37.6789 21.1977 36.9095 22.1947 36.4633C22.3537 35.3377 22.806 34.5694 23.3055 34.1339C19.4198 33.693 15.3341 32.1982 15.3341 25.5191C15.3341 23.6155 16.0163 22.0608 17.1358 20.842C16.9553 20.4012 16.3547 18.6292 17.3077 16.2291C17.3077 16.2291 18.7762 15.7604 22.1195 18.015C23.515 17.6287 25.0126 17.4361 26.5005 17.4286C27.9874 17.4361 29.4839 17.6287 30.8816 18.015C34.2227 15.7604 35.6891 16.2291 35.6891 16.2291C36.6442 18.6292 36.0436 20.4012 35.8642 20.842C36.9858 22.0608 37.6626 23.6155 37.6626 25.5191C37.6626 32.2154 33.5706 33.6888 29.673 34.12C30.3004 34.6582 30.8601 35.7218 30.8601 37.3483C30.8601 39.6777 30.8386 41.5578 30.8386 42.1292C30.8386 42.5957 31.1545 43.1382 32.0418 42.968C38.9905 40.6579 44 34.1296 44 26.4308C44 16.8038 36.164 9 26.4984 9Z"
                        fill="var(--accent)"
                        fill-rule="evenodd"/>
                </svg>
              </template>

              GitHub

              <template #caption>
                <ovc-link to="https://github.com/siailya" target="_blank" external>github.com/siailya</ovc-link>
              </template>
            </ovc-contact-card>
          </div>
        </div>

        <div class="row">
          <div class="col-12 col-lg-7">
            <ovc-contact-card class="mt-3">
              <template #icon>
                <svg width="100%" viewBox="0 0 52 52" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect x="1" y="1" width="50" height="50" rx="13" stroke="var(--accent)" stroke-width="2"/>
                  <path d="M23.3074 23.1651C23.3074 21.864 22.422 21.864 22.422 21.864H21.9529H18.7797H18.7783V24.6565H22.196C22.7869 24.6565 23.3074 24.4682 23.3074 23.1651Z" fill="var(--accent)"/>
                  <path d="M31.7479 24.6565C29.8155 24.6565 29.5464 26.5848 29.5464 26.5848H33.657C33.657 26.5848 33.6824 24.6565 31.7479 24.6565Z" fill="var(--accent)"/>
                  <path d="M22.4223 26.5848H18.7808V29.9292H22.0067C22.0615 29.9292 22.1423 29.9319 22.2388 29.9292C22.7572 29.9175 23.7426 29.7683 23.7426 28.3035C23.7426 26.5683 22.4223 26.5848 22.4223 26.5848Z" fill="var(--accent)"/>
                  <path d="M26 9C16.6262 9 9 16.6262 9 26C9 35.3738 16.6262 43 26 43C35.3738 43 43 35.3738 43 26C43 16.6262 35.3738 9 26 9ZM29.0075 20.3774H34.1706V21.9188H29.0075V20.3774ZM26.3979 28.4604C26.3979 32.2793 22.4221 32.154 22.4221 32.154H18.7805H18.6737H15.9113V19.6399H18.6737H18.7805H22.4221C24.4018 19.6399 25.9637 20.7335 25.9637 22.9727C25.9637 25.2112 24.0546 25.3536 24.0546 25.3536C26.5711 25.3536 26.3979 28.4604 26.3979 28.4604ZM36.0558 28.2549H29.5711C29.5711 30.5804 31.7733 30.4332 31.7733 30.4332C33.8529 30.4332 33.7796 29.0876 33.7796 29.0876H35.9832C35.9832 32.66 31.7007 32.4149 31.7007 32.4149C26.5629 32.4149 26.8929 27.6318 26.8929 27.6318C26.8929 27.6318 26.8888 22.8234 31.7007 22.8234C36.7659 22.8234 36.0558 28.2549 36.0558 28.2549Z" fill="var(--accent)"/>
                </svg>
              </template>

              Behance

              <template #caption>
                <ovc-link to="https://behance.net/siailya" target="_blank" external>behance.net/siailya</ovc-link>
              </template>
            </ovc-contact-card>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<script lang="ts" setup>
import OvcContactCard from "../components/OvcContactCard.vue";
import OvcLink from "../components/OvcLink.vue";</script>

<style scoped>
.border-hr {
  border-color: rgba(120, 120, 120, .5) !important;
}

@media screen and (max-width: 768px) {
  .border-hr {
    border: none!important;
  }
}
</style>
